[Killed] BlockStatement
main/pages/Books/BookCreatePage.js:6:42
 import BookForm from "main/components/Books/BookForm";
 import { bookUtils } from "main/utils/bookUtils";
 
-export default function BookCreatePage() {
-  let navigate = useNavigate();
-
-  const onSubmit = async (book) => {
-    const createdBook = bookUtils.add(book);
-    console.log("createdBook: " + JSON.stringify(createdBook));
-    navigate("/books");
-  };
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create New Book</h1>
-        <BookForm submitAction={onSubmit} />
-      </div>
-    </BasicLayout>
-  );
-}
+export default function BookCreatePage() {}
 
killedBy: BookCreatePage tests renders without crashing
statusReason: Error: BookCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Books/BookCreatePage.js:9:36
 export default function BookCreatePage() {
   let navigate = useNavigate();
 
-  const onSubmit = async (book) => {
-    const createdBook = bookUtils.add(book);
-    console.log("createdBook: " + JSON.stringify(createdBook));
-    navigate("/books");
-  };
+  const onSubmit = async (book) => {};
 
   return (
killedBy: BookCreatePage tests redirects to /books on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
