[Killed] BooleanLiteral
main/components/Hotels/HotelTable.js:16:17
 export default function HotelTable({
   hotels,
   currentUser,
-  showButtons = true,
+  showButtons = false,
   testIdPrefix = "HotelTable",
 }) {
killedBy: HotelIndexPage tests what happens when you click delete, admin
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HotelTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/components/Hotels/HotelTable.js:21:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    console.log(`editCallback: ${showCell(cell)}`);
-    navigate(`/hotels/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   const detailsCallback = (cell) => {
killedBy: HotelTable tests Edit button navigates to the edit page for admin
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/hotels/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Hotels/HotelTable.js:23:14
 
   const editCallback = (cell) => {
     console.log(`editCallback: ${showCell(cell)}`);
-    navigate(`/hotels/edit/${cell.row.values.id}`);
+    navigate(``);
   };
 
killedBy: HotelTable tests Edit button navigates to the edit page for admin
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/hotels/edit/2"
Received: ""

Number of calls: 1

<html>

[Killed] BlockStatement
main/components/Hotels/HotelTable.js:26:37
     navigate(`/hotels/edit/${cell.row.values.id}`);
   };
 
-  const detailsCallback = (cell) => {
-    console.log(`detailsCallback: ${showCell(cell)}`);
-    navigate(`/hotels/details/${cell.row.values.id}`);
-  };
+  const detailsCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: HotelTable tests Details button navigates to the details page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/hotels/details/2"

Number of calls: 0

<html>
  <head />
