[Killed] ArrowFunction
main/pages/Hotels/HotelCreatePage.js:8:31
 import { useBackendMutation } from "main/utils/useBackend";
 
 export default function HotelCreatePage() {
-  const objectToAxiosParams = (hotel) => ({
-    url: "/api/hotels/post",
-    method: "POST",
-    params: {
-      name: hotel.name,
-      address: hotel.address,
-      description: hotel.description,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (hotel) => {
killedBy: HotelCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/Hotels/HotelCreatePage.js:18:32
     },
   });
 
-  const onSuccess = (hotel) => {
-    toast(`New hotel created - id: ${hotel.id} name: ${hotel.name}`);
-  };
+  const onSuccess = (hotel) => {};
 
   const mutation = useBackendMutation(
killedBy: HotelCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New hotel created - id: 17 name: Grand Hotel"

Number of calls: 0

[Killed] StringLiteral
main/pages/Hotels/HotelCreatePage.js:19:11
   });
 
   const onSuccess = (hotel) => {
-    toast(`New hotel created - id: ${hotel.id} name: ${hotel.name}`);
+    toast(``);
   };
 
killedBy: HotelCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New hotel created - id: 17 name: Grand Hotel"
Received: ""

Number of calls: 1

[Killed] BlockStatement
main/pages/Hotels/HotelCreatePage.js:31:37
 
   const { isSuccess } = mutation;
 
-  const onSubmit = async (hotel) => {
-    mutation.mutate(hotel);
-  };
+  const onSubmit = async (hotel) => {};
 
   if (isSuccess) {
killedBy: HotelCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/Hotels/HotelCreatePage.js:35:18
     mutation.mutate(hotel);
   };
 
-  if (isSuccess) {
-    return <Navigate to="/hotels/" />;
-  }
+  if (isSuccess) {}
 
   return (
killedBy: HotelCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/hotels/"}

Number of calls: 0
