[Killed] ObjectLiteral
main/pages/Hotels/HotelDetailsPage.js:21:15
       // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
       method: "GET",
       url: "/api/hotels",
-      params: {
-        id,
-      },
+      params: {},
     }
   );
killedBy: HotelDetailsPage tests loads the correct fields, and no buttons
statusReason: TestingLibraryElementError: Unable to find an element with the text: Grand Hotel. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Survived] ArrayDeclaration
main/pages/Hotels/HotelDetailsPage.js:27:36
     }
   );
 
-  const hotels = hotel ? [hotel] : [];
+  const hotels = hotel ? [hotel] : ["Stryker was here"];
 
   return (

[Killed] BooleanLiteral
main/pages/Hotels/HotelDetailsPage.js:33:50
     <BasicLayout>
       <div className="pt-2">
         <h1>Hotel Details</h1>
-        <HotelTable hotels={hotels} showButtons={false} />
+        <HotelTable hotels={hotels} showButtons={true} />
       </div>
     </BasicLayout>
killedBy: HotelDetailsPage tests loads the correct fields, and no buttons
statusReason: TestingLibraryElementError: Found multiple elements with the text: Details

Here are the matching elements:

<th
  colspan="1"
  data-testid="HotelTable-header-Details"
  role="columnheader"
