[Killed] ArrowFunction
main/pages/Hotels/HotelEditPage.js:28:34
     }
   );
 
-  const objectToAxiosPutParams = (hotel) => ({
-    url: "/api/hotels",
-    method: "PUT",
-    params: {
-      id: hotel.id,
-    },
-    data: {
-      name: hotel.name,
-      address: hotel.address,
-      description: hotel.description,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (hotel) => {
killedBy: HotelEditPage tests when the backend is working normally changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Hotel Updated - id: 3 name: Best Hotel"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
main/pages/Hotels/HotelEditPage.js:30:13
 
   const objectToAxiosPutParams = (hotel) => ({
     url: "/api/hotels",
-    method: "PUT",
+    method: "",
     params: {
       id: hotel.id,
killedBy: HotelEditPage tests when the backend is working normally changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Hotel Updated - id: 3 name: Best Hotel"
Received: "Hotel Updated - id: 3 name: Grand Hotel"

Number of calls: 1

[Killed] ObjectLiteral
main/pages/Hotels/HotelEditPage.js:34:11
     params: {
       id: hotel.id,
     },
-    data: {
-      name: hotel.name,
-      address: hotel.address,
-      description: hotel.description,
-    },
+    data: {},
   });
 
killedBy: HotelEditPage tests when the backend is working normally changes when you click Update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"name\":\"Best Hotel\",\"address\":\"321 State\",\"description\":\"great place\"}"
Received: "{}"

[Killed] BlockStatement
main/pages/Hotels/HotelEditPage.js:41:32
     },
   });
 
-  const onSuccess = (hotel) => {
-    toast(`Hotel Updated - id: ${hotel.id} name: ${hotel.name}`);
-  };
+  const onSuccess = (hotel) => {};
 
   const mutation = useBackendMutation(
killedBy: HotelEditPage tests when the backend is working normally changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/Hotels/HotelEditPage.js:58:18
     mutation.mutate(data);
   };
 
-  if (isSuccess) {
-    return <Navigate to="/hotels" />;
-  }
+  if (isSuccess) {}
   return (
     <BasicLayout>
killedBy: HotelEditPage tests when the backend is working normally changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/hotels"}

Number of calls: 0

[Killed] LogicalOperator
main/pages/Hotels/HotelEditPage.js:65:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Hotel</h1>
-        {hotel && (
-          <HotelForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={hotel}
-          />
-        )}
+        {hotel || <HotelForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={hotel} />}
       </div>
     </BasicLayout>
killedBy: HotelEditPage tests when the backend doesn't return renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="HotelForm-name" id="name" name="name" type="text" /> instead

[Killed] ConditionalExpression
main/pages/Hotels/HotelEditPage.js:65:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Hotel</h1>
-        {hotel && (
-          <HotelForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={hotel}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: HotelEditPage tests when the backend is working normally Is populated with the data provide
statusReason: Error: Unable to find an element by: [data-testid="HotelForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
