[Killed] ObjectLiteral
main/pages/Hotels/HotelIndexPage.js:19:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/hotels/all"],
-    { method: "GET", url: "/api/hotels/all" },
+    {},
     []
   );
killedBy: HotelIndexPage tests renders three hotels without crashing for regular user
statusReason: Error: Unable to find an element by: [data-testid="HotelTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/pages/Hotels/HotelIndexPage.js:19:15
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/hotels/all"],
-    { method: "GET", url: "/api/hotels/all" },
+    { method: "", url: "/api/hotels/all" },
     []
   );
killedBy: HotelIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/hotels/all"
Received string:    "Error communicating with backend via  on /api/hotels/all"
