[Killed] BlockStatement
main/components/Hotels/HotelTable.js:8:47
 
 const showCell = (cell) => JSON.stringify(cell.row.values);
 
-const defaultDeleteCallback = async (cell) => {
-  console.log(`deleteCallback: ${showCell(cell)})`);
-  hotelUtils.del(cell.row.values.id);
-};
+const defaultDeleteCallback = async (cell) => {};
 
 export default function HotelTable({
killedBy: HotelTable tests Delete button calls delete callback
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/components/Hotels/HotelTable.js:17:18
   hotels,
   deleteCallback = defaultDeleteCallback,
   showButtons = true,
-  testIdPrefix = "HotelTable",
+  testIdPrefix = "",
 }) {
   const navigate = useNavigate();
killedBy: HotelTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HotelTable-cell-row-0-col-id"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] BlockStatement
main/components/Hotels/HotelTable.js:21:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    console.log(`editCallback: ${showCell(cell)})`);
-    navigate(`/hotels/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   const detailsCallback = (cell) => {
killedBy: HotelTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/hotels/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Hotels/HotelTable.js:23:14
 
   const editCallback = (cell) => {
     console.log(`editCallback: ${showCell(cell)})`);
-    navigate(`/hotels/edit/${cell.row.values.id}`);
+    navigate(``);
   };
 
killedBy: HotelTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/hotels/edit/2"
Received: ""

Number of calls: 1

<html>

[Killed] BlockStatement
main/components/Hotels/HotelTable.js:26:37
     navigate(`/hotels/edit/${cell.row.values.id}`);
   };
 
-  const detailsCallback = (cell) => {
-    console.log(`detailsCallback: ${showCell(cell)})`);
-    navigate(`/hotels/details/${cell.row.values.id}`);
-  };
+  const detailsCallback = (cell) => {};
 
   const columns = [
killedBy: HotelTable tests Details button navigates to the details page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/hotels/details/2"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Hotels/HotelTable.js:38:17
     },
     {
       Header: "Name",
-      accessor: "name",
+      accessor: "",
     },
     {
killedBy: HotelTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HotelTable-cell-row-0-col-name"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Hotels/HotelTable.js:40:5
       Header: "Name",
       accessor: "name",
     },
-    {
-      Header: "Address",
-      accessor: "address",
-    },
+    {},
     {
       Header: "Description",
killedBy: HotelTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Hotels/HotelTable.js:44:5
       Header: "Address",
       accessor: "address",
     },
-    {
-      Header: "Description",
-      accessor: "description",
-    },
+    {},
   ];
 
killedBy: HotelTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!
