[Killed] ObjectLiteral
main/components/Restaurants/RestaurantTable.js:42:9
             Header: 'Name',
             accessor: 'name',
         },
-        {
-            Header: 'Description',
-            accessor: 'description',
-        },
+        {},
         {
             Header: 'Address',
killedBy: RestaurantTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Restaurants/RestaurantTable.js:48:23
         },
         {
             Header: 'Address',
-            accessor: 'address',
+            accessor: "",
         }
     ];
killedBy: RestaurantTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RestaurantTable-cell-row-0-col-address"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
