[Killed] BlockStatement
main/pages/Hotels/HotelCreatePage.js:6:43
 import HotelForm from "main/components/Hotels/HotelForm";
 import { hotelUtils } from "main/utils/hotelUtils";
 
-export default function HotelCreatePage() {
-  let navigate = useNavigate();
-
-  const onSubmit = async (hotel) => {
-    const createdHotel = hotelUtils.add(hotel);
-    console.log("createdHotel: " + JSON.stringify(createdHotel));
-    navigate("/hotels");
-  };
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create New Hotel</h1>
-        <HotelForm submitAction={onSubmit} />
-      </div>
-    </BasicLayout>
-  );
-}
+export default function HotelCreatePage() {}
 
killedBy: HotelCreatePage tests renders without crashing
statusReason: Error: HotelCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Hotels/HotelCreatePage.js:9:37
 export default function HotelCreatePage() {
   let navigate = useNavigate();
 
-  const onSubmit = async (hotel) => {
-    const createdHotel = hotelUtils.add(hotel);
-    console.log("createdHotel: " + JSON.stringify(createdHotel));
-    navigate("/hotels");
-  };
+  const onSubmit = async (hotel) => {};
 
   return (
killedBy: HotelCreatePage tests redirects to /hotels on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Hotels/HotelCreatePage.js:11:17
 
   const onSubmit = async (hotel) => {
     const createdHotel = hotelUtils.add(hotel);
-    console.log("createdHotel: " + JSON.stringify(createdHotel));
+    console.log("" + JSON.stringify(createdHotel));
     navigate("/hotels");
   };
killedBy: HotelCreatePage tests redirects to /hotels on submit
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "createdHotel: {\"hotel\":{\"id\":1,\"name\":\"The Ritz-Carlton\",\"address\":\"1150 22nd St NW, Washington, DC 20037\",\"description\":\"Guests can enjoy stunning views of the city and easy access to top attractions.\"}"
Received string:    "{\"hotel\":{\"id\":1,\"name\":\"The Ritz-Carlton\",\"address\":\"1150 22nd St NW, Washington,

[Killed] StringLiteral
main/pages/Hotels/HotelCreatePage.js:12:14
   const onSubmit = async (hotel) => {
     const createdHotel = hotelUtils.add(hotel);
     console.log("createdHotel: " + JSON.stringify(createdHotel));
-    navigate("/hotels");
+    navigate("");
   };
 
killedBy: HotelCreatePage tests redirects to /hotels on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/hotels"
Received: ""

Number of calls: 1

<html>
