[Killed] BlockStatement
main/pages/Hotels/HotelDetailsPage.js:6:44
 import HotelTable from "main/components/Hotels/HotelTable";
 import { hotelUtils } from "main/utils/hotelUtils";
 
-export default function HotelDetailsPage() {
-  let { id } = useParams();
-
-  const response = hotelUtils.getById(id);
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Hotel Details</h1>
-        <HotelTable hotels={[response.hotel]} showButtons={false} />
-      </div>
-    </BasicLayout>
-  );
-}
+export default function HotelDetailsPage() {}
 
killedBy: HotelDetailsPage tests renders without crashing
statusReason: Error: HotelDetailsPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BooleanLiteral
main/pages/Hotels/HotelDetailsPage.js:15:60
     <BasicLayout>
       <div className="pt-2">
         <h1>Hotel Details</h1>
-        <HotelTable hotels={[response.hotel]} showButtons={false} />
+        <HotelTable hotels={[response.hotel]} showButtons={true} />
       </div>
     </BasicLayout>
killedBy: HotelDetailsPage tests loads the correct fields, and no buttons
statusReason: TestingLibraryElementError: Found multiple elements with the text: Delete

Here are the matching elements:

<th
  colspan="1"
  data-testid="HotelTable-header-Delete"
  role="columnheader"
