[Killed] BlockStatement
main/pages/Hotels/HotelEditPage.js:14:37
 
   const response = hotelUtils.getById(id);
 
-  const onSubmit = async (hotel) => {
-    const updatedHotel = hotelUtils.update(hotel);
-    console.log("updatedHotel: " + JSON.stringify(updatedHotel));
-    navigate("/hotels");
-  };
+  const onSubmit = async (hotel) => {};
 
   return (
killedBy: HotelEditPage tests redirects to /hotels on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Hotels/HotelEditPage.js:17:14
   const onSubmit = async (hotel) => {
     const updatedHotel = hotelUtils.update(hotel);
     console.log("updatedHotel: " + JSON.stringify(updatedHotel));
-    navigate("/hotels");
+    navigate("");
   };
 
killedBy: HotelEditPage tests redirects to /hotels on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/hotels"
Received: ""

Number of calls: 1

<html>
