[Killed] BlockStatement
main/pages/Hotels/HotelIndexPage.js:16:42
 
   const showCell = (cell) => JSON.stringify(cell.row.values);
 
-  const deleteCallback = async (cell) => {
-    console.log(`HotelIndexPage deleteCallback: ${showCell(cell)})`);
-    hotelUtils.del(cell.row.values.id);
-    navigate("/hotels");
-  };
+  const deleteCallback = async (cell) => {};
 
   return (
killedBy: HotelIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] StringLiteral
main/pages/Hotels/HotelIndexPage.js:19:14
   const deleteCallback = async (cell) => {
     console.log(`HotelIndexPage deleteCallback: ${showCell(cell)})`);
     hotelUtils.del(cell.row.values.id);
-    navigate("/hotels");
+    navigate("");
   };
 
killedBy: HotelIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/hotels"
Received: ""

Number of calls: 1

<html>

[Killed] StringLiteral
main/pages/Hotels/HotelIndexPage.js:25:33
   return (
     <BasicLayout>
       <div className="pt-2">
-        <Button style={{ float: "right" }} as={Link} to="/hotels/create">
+        <Button style={{ float: "" }} as={Link} to="/hotels/create">
           Create Hotel
         </Button>
killedBy: HotelIndexPage tests renders correct fields
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null

[Killed] ObjectLiteral
main/pages/Hotels/HotelIndexPage.js:25:24
   return (
     <BasicLayout>
       <div className="pt-2">
-        <Button style={{ float: "right" }} as={Link} to="/hotels/create">
+        <Button style={{}} as={Link} to="/hotels/create">
           Create Hotel
         </Button>
killedBy: HotelIndexPage tests renders correct fields
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
