[Killed] BlockStatement
src/main/utils/hotelUtils.js:1:25
-function setToDefault() {
-  const hotelCollection = { nextId: 1, hotels: [] };
-  return set(hotelCollection);
-}
+function setToDefault() {}
 
 // get hotels from local storage
killedBy: HotelTable tests Delete button calls delete callback
statusReason: TypeError: Cannot destructure property 'hotels' of 'hotelCollection' as it is undefined.

[Killed] BlockStatement
src/main/utils/hotelUtils.js:7:19
 }
 
 // get hotels from local storage
-const get = () => {
-  const value = localStorage.getItem("hotels");
-  if (value === undefined) {
-    return setToDefault();
-  }
-  const collection = JSON.parse(value);
-  if (collection === null) {
-    return setToDefault();
-  }
-
-  return collection;
-};
+const get = () => {};
 
 const getById = (id) => {
killedBy: HotelTable tests Delete button calls delete callback
statusReason: TypeError: Cannot destructure property 'hotels' of 'hotelCollection' as it is undefined.

[Killed] StringLiteral
src/main/utils/hotelUtils.js:8:38
 
 // get hotels from local storage
 const get = () => {
-  const value = localStorage.getItem("hotels");
+  const value = localStorage.getItem("");
   if (value === undefined) {
     return setToDefault();
killedBy: hotelUtils tests get When hotels is null in local storage, should set to empty list
statusReason: Error: Unexpected key:

[Killed] ConditionalExpression
src/main/utils/hotelUtils.js:9:7
 // get hotels from local storage
 const get = () => {
   const value = localStorage.getItem("hotels");
-  if (value === undefined) {
+  if (true) {
     return setToDefault();
   }
killedBy: hotelUtils tests get When hotels is [] in local storage, should return []
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "hotels", "{\"nextId\":1,\"hotels\":[]}"

[Killed] ConditionalExpression
src/main/utils/hotelUtils.js:9:7
 // get hotels from local storage
 const get = () => {
   const value = localStorage.getItem("hotels");
-  if (value === undefined) {
+  if (false) {
     return setToDefault();
   }
killedBy: hotelUtils tests get When hotels is undefined in local storage, should set to empty list
statusReason: SyntaxError: Unexpected token u in JSON at position 0

[Killed] ConditionalExpression
src/main/utils/hotelUtils.js:13:7
     return setToDefault();
   }
   const collection = JSON.parse(value);
-  if (collection === null) {
+  if (false) {
     return setToDefault();
   }
killedBy: hotelUtils tests get When hotels is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"hotels": [], "nextId": 1}
Received: null

[Killed] BlockStatement
src/main/utils/hotelUtils.js:13:28
     return setToDefault();
   }
   const collection = JSON.parse(value);
-  if (collection === null) {
-    return setToDefault();
-  }
+  if (collection === null) {}
 
   return collection;
killedBy: HotelTable tests Delete button calls delete callback
statusReason: TypeError: Cannot destructure property 'hotels' of 'hotelCollection' as it is null.

[Killed] BlockStatement
src/main/utils/hotelUtils.js:20:25
   return collection;
 };
 
-const getById = (id) => {
-  if (id === undefined) {
-    return { error: "id is a required parameter" };
-  }
-
-  // convert id from possibly a string to number
-  // this is better than using double equals (==)
-  id = Number(id);
-
-  const { hotels } = get();
-
-  const found = hotels.find((r) => r.id === id);
-  if (found === undefined) {
-    return { error: `hotel with id ${id} not found` };
-  }
-  return { hotel: found };
-};
+const getById = (id) => {};
 
 // set hotels in local storage
killedBy: hotelUtils tests getById Check that getting a hotel by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"hotel": {"address": "10100 Dream Tree Blvd, Orlando, FL 32836", "description": "Perfect for families and couples seeking a magical vacation in Orlando.", "id": 3, "name": "Four Seasons Resort Orlando at Walt Disney World"}}
Received: undefined

[Killed] BlockStatement
src/main/utils/hotelUtils.js:21:25
 };
 
 const getById = (id) => {
-  if (id === undefined) {
-    return { error: "id is a required parameter" };
-  }
+  if (id === undefined) {}
 
   // convert id from possibly a string to number
killedBy: hotelUtils tests getById Check that an error is returned when id not passed
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "id is a required parameter",
+   "error": "hotel with id NaN not found",

[Killed] ArrowFunction
src/main/utils/hotelUtils.js:31:29
 
   const { hotels } = get();
 
-  const found = hotels.find((r) => r.id === id);
+  const found = hotels.find(() => undefined);
   if (found === undefined) {
     return { error: `hotel with id ${id} not found` };
killedBy: hotelUtils tests getById Check that getting a hotel by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "hotel": Object {
-     "address": "10100 Dream Tree Blvd, Orlando, FL 32836",

[Killed] ConditionalExpression
src/main/utils/hotelUtils.js:31:36
 
   const { hotels } = get();
 
-  const found = hotels.find((r) => r.id === id);
+  const found = hotels.find((r) => true);
   if (found === undefined) {
     return { error: `hotel with id ${id} not found` };
killedBy: hotelUtils tests getById Check that getting a hotel by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
    "hotel": Object {
-     "address": "10100 Dream Tree Blvd, Orlando, FL 32836",

[Killed] ConditionalExpression
src/main/utils/hotelUtils.js:32:7
   const { hotels } = get();
 
   const found = hotels.find((r) => r.id === id);
-  if (found === undefined) {
+  if (true) {
     return { error: `hotel with id ${id} not found` };
   }
killedBy: hotelUtils tests getById Check that getting a hotel by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "hotel": Object {
-     "address": "10100 Dream Tree Blvd, Orlando, FL 32836",

[Killed] EqualityOperator
src/main/utils/hotelUtils.js:32:7
   const { hotels } = get();
 
   const found = hotels.find((r) => r.id === id);
-  if (found === undefined) {
+  if (found !== undefined) {
     return { error: `hotel with id ${id} not found` };
   }
killedBy: hotelUtils tests getById Check that getting a hotel by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "hotel": Object {
-     "address": "10100 Dream Tree Blvd, Orlando, FL 32836",

[Killed] StringLiteral
src/main/utils/hotelUtils.js:33:21
 
   const found = hotels.find((r) => r.id === id);
   if (found === undefined) {
-    return { error: `hotel with id ${id} not found` };
+    return { error: `` };
   }
   return { hotel: found };
killedBy: hotelUtils tests getById Check that getting a non-existing hotel returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "hotel with id 99 not found",
+   "error": "",

[Killed] BlockStatement
src/main/utils/hotelUtils.js:39:34
 };
 
 // set hotels in local storage
-const set = (hotelCollection) => {
-  localStorage.setItem("hotels", JSON.stringify(hotelCollection));
-  return hotelCollection;
-};
+const set = (hotelCollection) => {};
 
 // add a hotel to local storage
killedBy: hotelUtils tests get When hotels is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"hotels": [], "nextId": 1}
Received: undefined

[Killed] BlockStatement
src/main/utils/hotelUtils.js:45:24
 };
 
 // add a hotel to local storage
-const add = (hotel) => {
-  const hotelCollection = get();
-  hotel = { ...hotel, id: hotelCollection.nextId };
-  hotelCollection.nextId++;
-  hotelCollection.hotels.push(hotel);
-  set(hotelCollection);
-  return hotel;
-};
+const add = (hotel) => {};
 
 // update a hotel in local storage
killedBy: hotelUtils tests add Starting from [], check that adding one hotel works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"address": "1150 22nd St NW, Washington, DC 20037", "description": "Guests can enjoy stunning views of the city and easy access to top attractions.", "id": 1, "name": "The Ritz-Carlton"}
Received: undefined

[Killed] ObjectLiteral
src/main/utils/hotelUtils.js:47:11
 // add a hotel to local storage
 const add = (hotel) => {
   const hotelCollection = get();
-  hotel = { ...hotel, id: hotelCollection.nextId };
+  hotel = {};
   hotelCollection.nextId++;
   hotelCollection.hotels.push(hotel);
killedBy: hotelUtils tests add Starting from [], check that adding one hotel works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Object {
-   "address": "1150 22nd St NW, Washington, DC 20037",
-   "description": "Guests can enjoy stunning views of the city and easy access to top attractions.",

[Killed] UpdateOperator
src/main/utils/hotelUtils.js:48:3
 const add = (hotel) => {
   const hotelCollection = get();
   hotel = { ...hotel, id: hotelCollection.nextId };
-  hotelCollection.nextId++;
+  hotelCollection.nextId--;
   hotelCollection.hotels.push(hotel);
   set(hotelCollection);
killedBy: hotelUtils tests add Starting from [], check that adding one hotel works
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "hotels", "{\"nextId\":2,\"hotels\":[{\"id\":1,\"name\":\"The Ritz-Carlton\",\"address\":\"1150 22nd St NW, Washington, DC 20037\",\"description\":\"Guests can enjoy stunning views of the city and easy access to top attractions.\"}]}"
Received: "hotels", "{\"nextId\":0,\"hotels\":[{\"id\":1,\"name\":\"The Ritz-Carlton\",\"addres

[Killed] BlockStatement
src/main/utils/hotelUtils.js:55:27
 };
 
 // update a hotel in local storage
-const update = (hotel) => {
-  if (hotel === undefined) {
-    return { error: "hotel is a required parameter" };
-  }
-
-  const hotelCollection = get();
-  const { hotels } = hotelCollection;
-
-  const index = hotels.findIndex((r) => r.id === hotel.id);
-  if (index === -1) {
-    return { error: `hotel with id ${hotel.id} not found` };
-  }
-
-  hotels[index] = hotel;
-  set(hotelCollection);
-  return { hotelCollection };
-};
+const update = (hotel) => {};
 
 // delete a hotel from local storage
killedBy: hotelUtils tests update Check that updating an existing hotel works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] BlockStatement
src/main/utils/hotelUtils.js:56:28
 
 // update a hotel in local storage
 const update = (hotel) => {
-  if (hotel === undefined) {
-    return { error: "hotel is a required parameter" };
-  }
+  if (hotel === undefined) {}
 
   const hotelCollection = get();
killedBy: hotelUtils tests update Check that an error is returned when hotel not passed
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] EqualityOperator
src/main/utils/hotelUtils.js:56:7
 
 // update a hotel in local storage
 const update = (hotel) => {
-  if (hotel === undefined) {
+  if (hotel !== undefined) {
     return { error: "hotel is a required parameter" };
   }
killedBy: hotelUtils tests update Check that updating an existing hotel works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

  Object {
-   "hotelCollection": Object {
-     "hotels": Array [

[Killed] ConditionalExpression
src/main/utils/hotelUtils.js:63:41
   const hotelCollection = get();
   const { hotels } = hotelCollection;
 
-  const index = hotels.findIndex((r) => r.id === hotel.id);
+  const index = hotels.findIndex((r) => false);
   if (index === -1) {
     return { error: `hotel with id ${hotel.id} not found` };
killedBy: hotelUtils tests update Check that updating an existing hotel works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

  Object {
-   "hotelCollection": Object {
-     "hotels": Array [

[Killed] ConditionalExpression
src/main/utils/hotelUtils.js:63:41
   const hotelCollection = get();
   const { hotels } = hotelCollection;
 
-  const index = hotels.findIndex((r) => r.id === hotel.id);
+  const index = hotels.findIndex((r) => true);
   if (index === -1) {
     return { error: `hotel with id ${hotel.id} not found` };
killedBy: hotelUtils tests update Check that updating an non-existing hotel returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 22

  Object {
-   "error": "hotel with id 99 not found",
+   "hotelCollection": Object {

[Killed] UnaryOperator
src/main/utils/hotelUtils.js:64:17
   const { hotels } = hotelCollection;
 
   const index = hotels.findIndex((r) => r.id === hotel.id);
-  if (index === -1) {
+  if (index === +1) {
     return { error: `hotel with id ${hotel.id} not found` };
   }
killedBy: hotelUtils tests update Check that updating an non-existing hotel returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 23

  Object {
-   "error": "hotel with id 99 not found",
+   "hotelCollection": Object {

[Killed] ConditionalExpression
src/main/utils/hotelUtils.js:64:7
   const { hotels } = hotelCollection;
 
   const index = hotels.findIndex((r) => r.id === hotel.id);
-  if (index === -1) {
+  if (true) {
     return { error: `hotel with id ${hotel.id} not found` };
   }
killedBy: hotelUtils tests update Check that updating an existing hotel works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

  Object {
-   "hotelCollection": Object {
-     "hotels": Array [

[Killed] ObjectLiteral
src/main/utils/hotelUtils.js:65:12
 
   const index = hotels.findIndex((r) => r.id === hotel.id);
   if (index === -1) {
-    return { error: `hotel with id ${hotel.id} not found` };
+    return {};
   }
 
killedBy: hotelUtils tests update Check that updating an non-existing hotel returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "hotel with id 99 not found",
- }

[Killed] BlockStatement
src/main/utils/hotelUtils.js:74:21
 };
 
 // delete a hotel from local storage
-const del = (id) => {
-  if (id === undefined) {
-    return { error: "id is a required parameter" };
-  }
-
-  const hotelCollection = get();
-  const { hotels } = hotelCollection;
-
-  const index = hotels.findIndex((r) => r.id === id);
-  if (index === -1) {
-    return { error: `hotel with id ${id} not found` };
-  }
-
-  hotels.splice(index, 1);
-  set(hotelCollection);
-  return { hotelCollection };
-};
+const del = (id) => {};
 
 const hotelUtils = {
killedBy: hotelUtils tests del Check that deleting a hotel by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] BlockStatement
src/main/utils/hotelUtils.js:75:25
 
 // delete a hotel from local storage
 const del = (id) => {
-  if (id === undefined) {
-    return { error: "id is a required parameter" };
-  }
+  if (id === undefined) {}
 
   const hotelCollection = get();
killedBy: hotelUtils tests del Check that an error is returned when id not passed
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "id is a required parameter",
+   "error": "hotel with id undefined not found",

[Killed] ConditionalExpression
src/main/utils/hotelUtils.js:82:41
   const hotelCollection = get();
   const { hotels } = hotelCollection;
 
-  const index = hotels.findIndex((r) => r.id === id);
+  const index = hotels.findIndex((r) => false);
   if (index === -1) {
     return { error: `hotel with id ${id} not found` };
killedBy: hotelUtils tests del Check that deleting a hotel by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

  Object {
-   "hotelCollection": Object {
-     "hotels": Array [

[Killed] EqualityOperator
src/main/utils/hotelUtils.js:82:41
   const hotelCollection = get();
   const { hotels } = hotelCollection;
 
-  const index = hotels.findIndex((r) => r.id === id);
+  const index = hotels.findIndex((r) => r.id !== id);
   if (index === -1) {
     return { error: `hotel with id ${id} not found` };
killedBy: hotelUtils tests del Check that deleting a hotel by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -1,13 +1,13 @@
  Object {
    "hotelCollection": Object {

[Killed] ConditionalExpression
src/main/utils/hotelUtils.js:83:7
   const { hotels } = hotelCollection;
 
   const index = hotels.findIndex((r) => r.id === id);
-  if (index === -1) {
+  if (false) {
     return { error: `hotel with id ${id} not found` };
   }
killedBy: hotelUtils tests del Check that deleting a non-existing hotel returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 17

  Object {
-   "error": "hotel with id 99 not found",
+   "hotelCollection": Object {

[Killed] ConditionalExpression
src/main/utils/hotelUtils.js:83:7
   const { hotels } = hotelCollection;
 
   const index = hotels.findIndex((r) => r.id === id);
-  if (index === -1) {
+  if (true) {
     return { error: `hotel with id ${id} not found` };
   }
killedBy: hotelUtils tests del Check that deleting a hotel by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

  Object {
-   "hotelCollection": Object {
-     "hotels": Array [
